LOG_DB = {
    "create_blacklist": "Создал стандартные шаблоны",
    "db_err": "Ошибка базы данных - {error}",
    "export_csv": "Экспорт завершен",
    "start_parse": "🔄 Начинаем парсинг всех активных каналов",
    "process": "📡 Обрабатываем канал: {channel}",
    "parse_error": "❌ Ошибка при парсинге активных каналов: {e}",
    "save_post": "✅ Пост сохранён: {link} ({date})",
    "patter_error": "❌ Ошибка при добавлении шаблона '{pattern}': {e}",
    "in_blacklist": "ℹ Шаблон '{pattern}' уже в черном списке",
    "pattern_save": "✅ Шаблон '{pattern}' добавлен в черный список: {reason}",
}
